# YOLOv8s-ELDN
nc: 6
scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f_EMSC, [128, True]] # 改进点
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f_EMSC, [256, True]] # 改进点
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f_EMSC, [512, True]] # 改进点
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f_EMSC, [1024, True]] # 改进点
  - [-1, 1, SPPF_LSKA, [1024, 5]]  # 改进点

head:
  - [-1, 1, Dysample, [2]] # 改进点
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f_EMSC, [512]]

  - [-1, 1, Dysample, [2]] # 改进点
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_EMSC, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f_EMSC, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f_EMSC, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]